Revit 2026 API

# ConnectorVelocityPressure Property

---

The velocity pressure of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double VelocityPressure { get; }
```
```vb
Public ReadOnly Property VelocityPressure As Double
	Get
```
```cpp
public:
property double VelocityPressure {
	double get ();
}
```
```fsharp
member VelocityPressure : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This connector does not support flow calculation and associated properties. |

Instantaneous velocity pressure of this connector,calculated according to system.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace